Revit 2016 API
Face Class
A face of a 3d solid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public class Face : GeometryObject
Visual Basic
Public Class Face _
	Inherits GeometryObject
Visual C++
public ref class Face : public GeometryObject
Remarks
Faces are defined by surfaces bounded by edge loops. The surfaces provide natural UV parameterization to the faces.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.GeometryObject
 Autodesk.Revit.DB.Face
 Autodesk.Revit.DB.ConicalFace
 Autodesk.Revit.DB.CylindricalFace
 Autodesk.Revit.DB.HermiteFace
 Autodesk.Revit.DB.PlanarFace
 Autodesk.Revit.DB.RevolvedFace
 Autodesk.Revit.DB.RuledFace
See Also
Face Members
Autodesk.Revit.DB Namespace